УчетВУправляющихДляГит1/src/Catalogs/УПЖКХ_ВидыПомещений/УПЖКХ_ВидыПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>УПЖКХ_ВидыПомещений</name>
  <hierarchical>true</hierarchical>
  <attributes>
    <name>ТипПомещения</name>
    <type>
      <types>EnumRef.КВП_ТипыПомещений</types>
    </type>
  </attributes>
  <attributes>
    <name>НаименованиеКраткое</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>10</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ЭтоЖилойФонд</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ОтноситсяКМОП</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
</mdclass:Catalog>

УчетВУправляющихДляГит1/src/Enums/КВП_ТипыПомещений/КВП_ТипыПомещений.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>КВП_ТипыПомещений</name>
  <enumValues>
    <name>Квартира</name>
  </enumValues>
  <enumValues>
    <name>Офис</name>
  </enumValues>
  <enumValues>
    <name>Дом</name>
  </enumValues>
  <enumValues>
    <name>ПодсобноеПомещение</name>
  </enumValues>
  <enumValues>
    <name>МестоОбщегоПользования</name>
  </enumValues>
  <enumValues>
    <name>Автоместо</name>
  </enumValues>
  <enumValues>
    <name>Комната</name>
  </enumValues>
  <enumValues>
    <name>Кабинет</name>
  </enumValues>
  <enumValues>
    <name>Коридор</name>
  </enumValues>
  <enumValues>
    <name>Кухня</name>
  </enumValues>
  <enumValues>
    <name>Санузел</name>
  </enumValues>
  <enumValues>
    <name>Чердак</name>
  </enumValues>
  <enumValues>
    <name>Подвал</name>
  </enumValues>
  <enumValues>
    <name>Апартамент</name>
  </enumValues>
  <enumValues>
    <name>КваритрыДляАО</name>
  </enumValues>
  <enumValues>
    <name>ЖилыеПомещенияДляГИС</name>
  </enumValues>
  <enumValues>
    <name>НеЖилыеПомещенияДляГИС</name>
  </enumValues>
</mdclass:Enum>

УчетВУправляющихДляГит1/src/Catalogs/УПЖКХ_ВидыПомещений/ObjectModule.bsl
#Область СлужебныеПроцедурыИФункции

// Устарела. В будущем можно удалить. Теперь тип фонда хранится в реквизите вида помещения.
// Определяет тип фонда в зависимости от выбранного типа помещения.
Функция ПолучитьДанныеОТипеФондаВидаПомещения(ВыбТипПомещения) Экспорт 
	
	ТипФондаПомещения = "Нежилое";
	
	СписокТиповЖилыхПомещений = Справочники.УПЖКХ_ВидыПомещений.ПолучитьСписокТиповПомещений(Истина);
	Если НЕ СписокТиповЖилыхПомещений.НайтиПоЗначению(ВыбТипПомещения) = Неопределено Тогда
		ТипФондаПомещения = "Жилое";
	КонецЕсли;
	
	Возврат ТипФондаПомещения;

КонецФункции // ПолучитьДанныеОТипеФондаВидаПомещения()

// Дозаполняет элемент справочника обязательными значениями.
// Справочник участвует в интерфейсе (внутреннем АПИ) для загрузки данных о помещениях.
// Параметр "ДанныеДляЗаписи" - не используется, выполняет роль заглушки.
//
Процедура ДозаполнитьЭлементСправочника(Наименование = Неопределено, ДанныеДляЗаписи = Неопределено, НовыйЭлементСправочника) Экспорт
	
	Если Наименование = "Квартира" Тогда
		
		НаименованиеКраткое = "Кв.";
		
		НовыйЭлементСправочника.НаименованиеКраткое = НаименованиеКраткое;
		НовыйЭлементСправочника.ЭтоЖилойФонд        = Истина;
		НовыйЭлементСправочника.ТипПомещения        = Перечисления.КВП_ТипыПомещений.Квартира;
		
	ИначеЕсли Наименование = "Дом" Тогда
		
		НаименованиеКраткое = "Кв.";
		
		НовыйЭлементСправочника.НаименованиеКраткое = НаименованиеКраткое;
		НовыйЭлементСправочника.ЭтоЖилойФонд        = Истина;
		НовыйЭлементСправочника.ТипПомещения        = Перечисления.КВП_ТипыПомещений.Дом;
		
	ИначеЕсли Наименование = "Офис" Тогда
		
		НаименованиеКраткое = "Оф.";
		
		НовыйЭлементСправочника.НаименованиеКраткое = НаименованиеКраткое;
		НовыйЭлементСправочника.ЭтоЖилойФонд        = Ложь;
		НовыйЭлементСправочника.ТипПомещения        = Перечисления.КВП_ТипыПомещений.Офис;
		
	ИначеЕсли Наименование = "ПодсобноеПомещение" Тогда
		
		НаименованиеКраткое = "П/п";
		
		НовыйЭлементСправочника.НаименованиеКраткое = НаименованиеКраткое;
		НовыйЭлементСправочника.ЭтоЖилойФонд        = Ложь;
		НовыйЭлементСправочника.ТипПомещения        = Перечисления.КВП_ТипыПомещений.ПодсобноеПомещение;
		
	ИначеЕсли Наименование = "Автоместо" Тогда
		
		НаименованиеКраткое = "А/м";
		
		НовыйЭлементСправочника.НаименованиеКраткое = НаименованиеКраткое;
		НовыйЭлементСправочника.ЭтоЖилойФонд        = Ложь;
		НовыйЭлементСправочника.ТипПомещения        = Перечисления.КВП_ТипыПомещений.Автоместо;
		
	ИначеЕсли Наименование = "МестоОбщегоПользования" Тогда
		
		НаименованиеКраткое = "МОП";
		
		НовыйЭлементСправочника.НаименованиеКраткое = НаименованиеКраткое;
		НовыйЭлементСправочника.ЭтоЖилойФонд        = Ложь;
		НовыйЭлементСправочника.ТипПомещения        = Перечисления.КВП_ТипыПомещений.МестоОбщегоПользования;
		
	ИначеЕсли Наименование = "Комната" Тогда
		
		НаименованиеКраткое = "Комн.";
		
		НовыйЭлементСправочника.НаименованиеКраткое = НаименованиеКраткое;
		НовыйЭлементСправочника.ЭтоЖилойФонд        = Истина;
		НовыйЭлементСправочника.ТипПомещения        = Перечисления.КВП_ТипыПомещений.Комната;
		
	ИначеЕсли Наименование = "Кабинет" Тогда
		
		НаименованиеКраткое = "Каб.";
		
		НовыйЭлементСправочника.НаименованиеКраткое = НаименованиеКраткое;
		НовыйЭлементСправочника.ЭтоЖилойФонд        = Ложь;
		НовыйЭлементСправочника.ТипПомещения        = Перечисления.КВП_ТипыПомещений.Кабинет;
		
	ИначеЕсли Наименование = "Кухня" Тогда
		
		НаименованиеКраткое = "Кух.";
		
		НовыйЭлементСправочника.НаименованиеКраткое = НаименованиеКраткое;
		НовыйЭлементСправочника.ЭтоЖилойФонд        = Истина;
		НовыйЭлементСправочника.ТипПомещения        = Перечисления.КВП_ТипыПомещений.Кухня;
		
	ИначеЕсли Наименование = "Коридор" Тогда
		
		НаименованиеКраткое = "Кор.";
		
		НовыйЭлементСправочника.НаименованиеКраткое = НаименованиеКраткое;
		НовыйЭлементСправочника.ЭтоЖилойФонд        = Истина;
		НовыйЭлементСправочника.ТипПомещения        = Перечисления.КВП_ТипыПомещений.Коридор;
		
	ИначеЕсли Наименование = "Санузел" Тогда
		
		НаименованиеКраткое = "С/у";
		
		НовыйЭлементСправочника.НаименованиеКраткое = НаименованиеКраткое;
		НовыйЭлементСправочника.ЭтоЖилойФонд        = Ложь;
		НовыйЭлементСправочника.ТипПомещения        = Перечисления.КВП_ТипыПомещений.Санузел;
		
	ИначеЕсли Наименование = "Подвал" Тогда
		
		НаименованиеКраткое = "Подв.";
		
		НовыйЭлементСправочника.НаименованиеКраткое = НаименованиеКраткое;
		НовыйЭлементСправочника.ЭтоЖилойФонд        = Ложь;
		НовыйЭлементСправочника.ТипПомещения        = Перечисления.КВП_ТипыПомещений.Подвал;
		
	ИначеЕсли Наименование = "Чердак" Тогда
		
		НаименованиеКраткое = "Чер.";
		
		НовыйЭлементСправочника.НаименованиеКраткое = НаименованиеКраткое;
		НовыйЭлементСправочника.ЭтоЖилойФонд        = Ложь;
		НовыйЭлементСправочника.ТипПомещения        = Перечисления.КВП_ТипыПомещений.Чердак;
		
	ИначеЕсли Наименование = "Апартамент" Тогда
		
		НаименованиеКраткое = "Апарт.";
		
		НовыйЭлементСправочника.НаименованиеКраткое = НаименованиеКраткое;
		НовыйЭлементСправочника.ЭтоЖилойФонд        = Истина;
		НовыйЭлементСправочника.ТипПомещения        = Перечисления.КВП_ТипыПомещений.Апартамент;
		
	КонецЕсли;
	
КонецПроцедуры // ДозаполнитьЭлементСправочника()

#КонецОбласти
